app/controllers/agenda_controller.rb

  def index
    user = User.find_by username: params[:username]
    if user
      id = user.id
      post = User.joins(:posts).select('user_id', "title", "description", "date", "level").where("user_id = ?", id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`username` = 'Mathieu' LIMIT 1
SELECT `users`.`id`, user_id, title, description, date, level FROM `users` INNER JOIN `posts` ON `posts`.`user_id` = `users`.`id` WHERE (user_id = 1)

  def create
    post = Post.create(user_id: params[:user_id], title: params[:title], description: params[:description], date: params[:date], level: params[:level])
---
INSERT INTO `posts` (`title`, `description`, `date`, `user_id`, `level`) VALUES ('Cours de piano', 'Cours avec Xavier Edouard Horremans', '2016-08-17 16:00:00', 1, 3)

  def update
    post = Post.find(params[:id]) #ID du post
    post.title = params[:title]
    post.description = params[:description]
    post.date = params[:date]
    post.level = params[:level]
    post = post.save
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `description` = 'Cours avec Xavier-Edouard-Horremas' WHERE `posts`.`id` = 1

  def destroy
    post = Post.find(params[:id]) #Recherche le post qui correspond à l'id
    post = post.destroy #On supprime le post
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 1