app/controllers/user_controller.rb

  def create
    user = User.create(username: params[:username]) #JSON {username: params[:username]} => Crée l'utilisateur
---
INSERT INTO `users` (`username`, `created_at`, `updated_at`) VALUES ('Mathieu', '2016-08-14 17:38:50', '2016-08-14 17:38:50')